12/data/attachments/686797aec6cdb8c1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7517b9fd-d6d3-4a46-9355-acf0c1718140</nif:username>
            <nif:friendToBeAdded>Nicholas_pay_Friend_71704_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>